import { PageLayout } from '../../components';

const HistoryOfBuddhismPage = () => {
    return (
        <PageLayout>
            <div>
                พุทธประวัติ
            </div>
            <div class = "text">
            ประสูติ 
       พระพุทธเจ้า พระนามเดิมว่า “ สิทธัตถะ “ เป็นพระราชโอรสของพระเจ้าสุทโธทนะและพระนางสิริมหามายา แห่งกรุงกบิลพัสดุ์ แคว้นสักกะ พระองค์ทรงถือกำเนิดในศากยวงค์ สกุลโคตมะ พระองค์ประสูติ ในวันศุกร์ ขึ้น ๑๕ ค่ำ เดือน ๖ ( เดือนวิสาขะ ) ปีจอ ก่อนพุทธศักราช ๘๐ ปี ณ สวนลุมพินีวัน ซึ่งตั้งอยู่ระหว่างกรุงกบิลพัสดุ์ แคว้นสักกะ กับกรุงเทวทหะ แคว้นโกลิยะ ( ปัจจุบันคือตำบลรุมมินเด ประเทศเนปาล )
            </div>
        </PageLayout>
    );
};

export default HistoryOfBuddhismPage;
