import { PageLayout } from '../../components';
import './style.css';
const ColoredLine = ({ color }) => (
    <hr
      style={{
        color,
        backgroundColor: color,
        height: 1
      }}
    />
  );

const ReligiousDayPage = () => {
    return (
        <PageLayout>
            <div className="Title">
                <div className="follow">
                    <line>.</line>
                    <br></br>
                    <line>.</line>
                    <br></br>
                    <line>|</line>
                    <br></br>
                    <br></br>
                    <a href="#first" style={{color: 'white'}}>วันมาฆบูชา</a>
                    <br></br>
                    <br></br>
                    <br></br>
                    <a href="#second"style={{color: 'white'}}>วันวิสาขบูชา</a>
                    <br></br>
                    <br></br>
                    <br></br>
                    <a href="#third"style={{color: 'white'}}>วันอัฏฐมีบูชา</a>
                    <br></br>
                    <br></br>
                    <br></br>
                    <a href="#fouth"style={{color: 'white'}}>วันอาสาฬหบูชา</a>
                    <br></br>
                    <br></br>
                    <br></br>
                    <a href="#fifth"style={{color: 'white'}}>วันเข้าพรรษา</a>
                    <br></br>
                    <br></br>
                    <br></br>
                    <a href="#sixth"style={{color: 'white'}}>วันออกพรรษา</a> 
                    <br></br>
                    <br></br>
                    <line>|</line>
                    <br></br>
                    <line>.</line>
                    <br></br>
                    <line>.</line>
                    
                </div>
            </div>
            <article>
                <section id="first">
                    <h1>วันมาฆบูชา</h1>
                    <div className="row">
                        <div className="col-7">
                            <p>
                                วันมาฆบูชา (บาลี: มาฆปูชา; อักษรโรมัน: Magha Puja)
                                เป็นวันสำคัญของชาวพุทธเถรวาทและวันหยุดราชการในประเทศไทย "มาฆบูชา" ย่อมาจาก
                                "มาฆปูรณมีบูชา" หมายถึง การบูชาในวันเพ็ญกลางเดือนมาฆะตามปฏิทินอินเดีย หรือเดือน 3
                                ตามปฏิทินจันทรคติของไทย (ตกช่วงเดือนกุมภาพันธ์หรือมีนาคม) ถ้าปีใดมีเดือนอธิกมาส
                                คือมีเดือน 8 สองหน (ปีอธิกมาส) ก็เลื่อนไปทำในวันเพ็ญเดือน 3 หลัง (วันเพ็ญเดือน 4).
                            </p>
                        </div>
                        <div className="col">
                            <img
                                src="https://i.ibb.co/3mxyM5d/scan063.jpg"
                                alt="scan063"
                                border="0"
                                style={{ width: '300px' }}
                            ></img>
                        </div>
                    </div>
                    <p>
                        วันมาฆบูชาได้รับการยกย่องเป็นวันสำคัญทางศาสนาพุทธ เนื่องจากเหตุการณ์สำคัญที่เกิดขึ้นเมื่อ 2,500
                        กว่าปีก่อน คือ
                        พระโคตมพุทธเจ้าทรงแสดงโอวาทปาติโมกข์ท่ามกลางที่ประชุมมหาสังฆสันนิบาตครั้งใหญ่ในพระพุทธศาสนา
                        คัมภีร์ปปัญจสูทนีระบุว่าครั้งนั้นมีเหตุการณ์เกิดขึ้นพร้อมกัน 4 ประการ คือ พระภิกษุ 1,250 รูป
                        ได้มาประชุมพร้อมกันยังวัดเวฬุวันโดยมิได้นัดหมาย, พระภิกษุทั้งหมดนั้นเป็น "เอหิภิกขุอุปสัมปทา"
                        หรือผู้ได้รับการอุปสมบทจากพระพุทธเจ้าโดยตรง, พระภิกษุทั้งหมดนั้นล้วนเป็นพระอรหันต์ผู้ทรงอภิญญา
                        6, และวันดังกล่าวตรงกับวันเพ็ญเดือน 3 ดังนั้น จึงเรียกวันนี้อีกอย่างหนึ่งว่า
                        "วันจาตุรงคสันนิบาต" หรือ วันที่มีการประชุมพร้อมด้วยองค์ 4
                    </p>
                    <div>
                        <ColoredLine color="black" />
                    </div>
                    <br></br>
                </section>
                <section id="second">
                    <h1>วันวิสาขบูชา</h1>
                    <div className="row">
                        <div className="col-7">
                            <p>
                                วันวิสาขบูชา นั้นได้รับการยกย่องจากพุทธศาสนิกชนทั่วโลกให้เป็นวันสำคัญสากลทางพระพุทธศาสนา
                                เนื่องจากเป็นวันที่บังเกิดเหตุการณ์สำคัญ 3 เหตุการณ์
                                ที่เกี่ยวเนื่องกับพระพุทธเจ้าและจุดเริ่มต้นของศาสนาพุทธ
                                ซึ่งเหตุการณ์ทั้งหมดได้เกิดขึ้นเมื่อ 2,500 กว่าปีก่อน ณ
                                ดินแดนที่เรียกว่าชมพูทวีปในสมัยพุทธกาล โดยเหตุการณ์แรก เมื่อ 80 ปี ก่อนพุทธศักราช เป็น
                                "วันประสูติของเจ้าชายสิทธัตถะ" ณ ใต้ร่มสาลพฤกษ์ ในพระราชอุทยานลุมพินีวัน
                                (อยู่ในเขตประเทศเนปาลในปัจจุบัน) และเหตุการณ์ต่อมา เมื่อ 45 ปี
                            </p>
                        </div>
                        <div className="col">
                            <img
                                src="https://i.ibb.co/hdJSfDm/1-1.jpg"
                                alt="1-1"
                                border="0"
                                style={{ width: '300px' }}
                            ></img>
                        </div>
                    </div>
                    <p>
                        ก่อนพุทธศักราช เป็น "วันที่เจ้าชายสิทธัตถะได้บรรลุพระสัมมาสัมโพธิญาณ
                        ตรัสรู้เป็นองค์สมเด็จพระสัมมาสัมพุทธเจ้า" ณ ใต้ร่มโพธิ์พฤกษ์ ริมฝั่งแม่น้ำเนรัญชรา
                        ตำบลอุรุเวลาเสนานิคม (อยู่ในเขตประเทศอินเดียในปัจจุบัน)และเหตุการณ์สุดท้าย เมื่อ 1 ปี
                        ก่อนพุทธศักราช เป็น "วันเสด็จดับขันธปรินิพพานขององค์สมเด็จพระสัมมาสัมพุทธเจ้า" ณ ใต้ร่มสาลพฤกษ์
                        ในสาลวโนทยาน พระราชอุทยานของเจ้ามัลละ เมืองกุสินารา (อยู่ในเขตประเทศอินเดียในปัจจุบัน)
                    </p>
                    <p>
                        โดยเหตุการณ์ทั้งหมดล้วนเกิดตรงกับวันเพ็ญเดือน 6 หรือเดือนวิสาขะนี้ทั้งสิ้น
                        ชาวพุทธจึงนับถือว่าวันเพ็ญเดือน 6 นี้ เป็นวันที่รวมวันคล้ายวันเกิดเหตุการณ์สำคัญ ๆ
                        ของพระพุทธเจ้าไว้มากที่สุด และได้นิยมประกอบพิธีบำเพ็ญบุญกุศลและประกอบพิธีพุทธบูชาต่าง ๆ
                        เพื่อเป็นการถวายสักการะรำลึกถึงแด่องค์สมเด็จพระสัมมาสัมพุทธเจ้าสืบมาจนปัจจุบัน
                    </p>
                    <div>
                        <ColoredLine color="black" />
                    </div>
                    <br></br>
                </section>
                <section id="third">
                    <h1>วันอัฏฐมีบูชา</h1>
                    <div className="row">
                        <div className="col-7">
                            <p>
                                วันอัฏฐมีบูชา คือวันถวายพระเพลิงพระพุทธสรีระของสมเด็จพระสัมมาสัมพุทธเจ้า
                                (หลังเสด็จดับขันธปรินิพพานได้ 8 วัน) ถือเป็นวันสำคัญในพระพุทธศาสนาวันหนึ่ง ตรงกับวันแรม
                                8 ค่ำ เดือนวิสาขะ (เดือน 6 ของไทย)
                            </p>
                            <p>
                                นอกจากนั้น วันนี้เป็นวันคล้ายวันที่พระนางสิริมหามายา องค์พระพุทธมารดาสิ้นพระชนม์
                                (หลังประสูติ) และเป็นวันคล้ายวันที่พระพุทธองค์เสวยวิมุตติสุขตลอด 7 วัน (หลังตรัสรู้)
                                อีกด้วย
                            </p>
                        </div>
                        <div className="col">
                            <img
                                src="https://i.ibb.co/1MQvQbn/thumb-file.jpg"
                                alt="thumb-file"
                                border="0"
                                style={{ width: '300px' }}
                            ></img>
                        </div>
                    </div>
                    <p>
                        เมื่อองค์สมเด็จพระสัมมาสัมพุทธเจ้า ได้เสด็จปรินิพพานไปแล้ว 8 วัน มัลละกษัตริย์แห่งเมืองกุสินารา
                        พร้อมด้วยประชาชน และพระสงฆ์อันมีพระมหากัสสปเถระเป็นประธาน
                        ได้พร้อมกันกระทำการถวายพระเพลิงพุทธสรีระ ณ มกุฏพันธนเจดีย์ แห่งเมืองกุสินารา
                        เป็นวันหนึ่งที่ชาวพุทธต้องมีความโศกเศร้าเสียใจเป็นอย่างยิ่ง เพราะการสูญเสียแห่งพระพุทธสรีระ
                        เมื่อวันแรม 8 ค่ำ เดือน 6 ซึ่งนิยมเรียกกันว่าวันอัฏฐมีนั้น เมื่อเวียนมาบรรจบแต่ละปี
                        พุทธศาสนิกชนบางส่วนได้ประกอบพิธีบูชาขึ้น มีการเวียนเทียนเป็นต้น แต่ไม่ทั่วไปทั่วราชอาณาจักร
                        โดยจะประกอบพิธีในบางวัดเท่านั้น ตามแต่ความศรัทธาของท้องถิ่น ในจังหวัดอุตรดิตถ์ เช่น
                        ประเพณีถวายพระเพลิงฯ จำลอง ที่วัดพระบรมธาตุทุ่งยั้ง และประเพณีอัฎฐมีบูชาของ วัดใหม่สุคนธาราม
                        ต.วัดละมุด อำเภอนครชัยศรี จังหวัดนครปฐม ที่รักษาสืบสานมายาวนานมากกว่า 120 ปีแล้ว เป็นต้น
                    </p>
                    <div>
                        <ColoredLine color="black" />
                    </div>
                    <br></br>
                </section>
                <section id="fouth">
                    <h1>วันอาสาฬหบูชา</h1>
                    <div className="row">
                        <div className="col-7">
                            <p>
                                วันอาสาฬหบูชา (บาลี: อาสาฬหปูชา; อักษรโรมัน: Āsāḷha Pūjā)
                                เป็นวันสำคัญทางศาสนาพุทธนิกายเถรวาทและวันหยุดราชการในประเทศไทย คำว่า อาสาฬหบูชา ย่อมาจาก
                                "อาสาฬหปูรณมีบูชา" แปลว่า "การบูชาในวันเพ็ญเดือนอาสาฬหะ"
                                อันเป็นเดือนที่สี่ตามปฏิทินของประเทศอินเดีย ตรงกับวันเพ็ญ เดือน 8
                                ตามปฏิทินจันทรคติของไทย ซึ่งมักจะตรงกับเดือนกรกฎาคมหรือเดือนสิงหาคม แต่ถ้าในปีใดมีเดือน
                                8 สองหน ก็ให้เลื่อนไปทำในวันเพ็ญเดือน 8 หลังแทน
                            </p>
                        </div>
                        <div className="col">
                            <img
                                src="https://i.ibb.co/rQFr75S/d6a368adbd17290fdde275daa3f70c72.jpg"
                                alt="d6a368adbd17290fdde275daa3f70c72"
                                border="0"
                                style={{ width: '300px' }}
                            ></img>
                        </div>
                    </div>
                    <p>
                        วันอาสาฬหบูชาได้รับการยกย่องเป็นวันสำคัญทางพระพุทธศาสนา เนื่องจากเหตุการณ์สำคัญที่เกิดขึ้นเมื่อ
                        45 ปี ก่อนพุทธศักราช ในวันขึ้น 15 ค่ำ เดือน 8 คือวันอาสาฬหปุรณมีดิถี หรือวันเพ็ญเดือนอาสาฬหะ ณ
                        ป่าอิสิปตนมฤคทายวัน เมืองพาราณสี แคว้นกาสี อันเป็นวันที่พระพุทธเจ้าทรงแสดงปฐมเทศนาคือ
                        ธัมมจักกัปปวัตตนสูตรแก่ปัญจวัคคีย์
                    </p>
                    <p>
                        การแสดงธรรมครั้งนั้นทำให้พราหมณ์โกณฑัญญะ 1 ในปัญจวัคคีย์ ประกอบด้วย โกณฑัญญะ วัปปะ ภัททิยะ
                        มหานามะ และอัสสชิ เกิดความเลื่อมใสในพระธรรมของพระพุทธเจ้า
                        จนได้ดวงตาเห็นธรรมหรือบรรลุเป็นพระอริยบุคคลระดับโสดาบัน
                        ท่านจึงขออุปสมบทในพระธรรมวินัยของพระพุทธเจ้า ด้วยวิธีเอหิภิกขุอุปสัมปทา
                        พระอัญญาโกณฑัญญะจึงกลายเป็นพระสาวกและภิกษุองค์แรกในโลก
                        และทำให้ในวันนั้นมีพระรัตนตรัยครบองค์สามบริบูรณ์เป็นครั้งแรกในโลก คือ มีทั้งพระพุทธเจ้า พระธรรม
                        และพระสงฆ์ ด้วยเหตุนี้จึงทำให้วันนี้ถูกเรียกว่า "วันพระธรรม" หรือ วันพระธรรมจักร
                        อันได้แก่วันที่ล้อแห่งพระธรรมของพระพุทธเจ้าได้หมุนไปเป็นครั้งแรก และ "วันพระสงฆ์"
                        คือวันที่มีพระสงฆ์เกิดขึ้นเป็นครั้งแรก และจัดว่าเป็น"วันพระรัตนตรัย" อีกด้วย
                    </p>
                    <div>
                        <ColoredLine color="black" />
                    </div>
                    <br></br>
                </section>
                <section id="fifth">
                    <h1>วันเข้าพรรษา</h1>
                    <div className="row">
                        <div className="col-7">
                            <p>
                                วันเข้าพรรษา (วันแรม 1 ค่ำ เดือน 8 หรือปีอธิกมาส จะเลื่อนเป็นวันแรม 1 ค่ำเดือน 8 หลัง)
                                หรือเทศกาลเข้าพรรษา (วันแรม 1 ค่ำ เดือน 8 ถึงวันขึ้น 15 ค่ำ เดือน 11 หรือปีอธิกมาส
                                จะเลื่อนเป็นวันแรม 1 ค่ำเดือน 8 หลัง ถึงวันขึ้น 15 ค่ำ เดือน 11)
                                ถือว่าเป็นวันและช่วงเทศกาลทางศาสนาพุทธที่สำคัญเทศกาลหนึ่งในประเทศไทย โดยมีระยะเวลาประมาณ
                                3 เดือนในช่วงฤดูฝน
                                โดยวันเข้าพรรษาเป็นวันสำคัญทางพระพุทธศาสนาที่ต่อเนื่องมาจากวันอาสาฬหบูชา (วันขึ้น 15 ค่ำ
                                เดือน 8)
                                ซึ่งพุทธศาสนิกชนชาวไทยทั้งพระมหากษัตริย์และคนทั่วไปได้สืบทอดประเพณีปฏิบัติการทำบุญในวันเข้าพรรษามาช้านานแล้วตั้งแต่สมัยสุโขทัย
                            </p>
                        </div>
                        <div className="col">
                            <img
                                src="https://i.ibb.co/q9SncV4/buddha-teach-dharma-tusita-heaven-i-1024x672.jpg"
                                alt="buddha-teach-dharma-tusita-heaven-i-1024x672"
                                border="0"
                                style={{ width: '300px' }}
                            ></img>
                        </div>
                    </div>
                    <p>
                        สาเหตุที่พระพุทธเจ้าทรงอนุญาตการจำพรรษาอยู่ ณ สถานที่ใดสถานที่หนึ่งตลอด 3 เดือนแก่พระสงฆ์นั้น
                        มีเหตุผลเพื่อให้พระสงฆ์ได้หยุดพักการจาริกเพื่อเผยแพร่ศาสนาไปตามสถานที่ต่าง ๆ
                        ซึ่งจะเป็นไปด้วยความยากลำบากในช่วงฤดูฝน
                        เพื่อป้องกันความเสียหายจากการอาจเดินเหยียบย่ำธัญพืชของชาวบ้านที่ปลูกลงแปลงในฤดูฝน
                        และโดยเฉพาะอย่างยิ่ง ช่วงเวลาจำพรรษาตลอด 3 เดือนนั้น
                        เป็นช่วงเวลาและโอกาสสำคัญในรอบปีที่พระสงฆ์จะได้มาอยู่จำพรรษารวมกันภายในอาวาสหรือสถานที่ใดสถานที่หนึ่ง
                        เพื่อศึกษาพระธรรมวินัยจากพระสงฆ์ที่ทรงความรู้
                        ได้แลกเปลี่ยนประสบการณ์และสร้างความสามัคคีในหมู่คณะสงฆ์ด้วย
                    </p>
                    <div>
                        <ColoredLine color="black" />
                    </div>
                    <br></br>
                </section>
                <section id="sixth">
                    <h1>วันออกพรรษา</h1>
                    <div className="row">
                        <div className="col-7">
                            <p>
                                เพื่อความเข้าใจ: วันสุดท้ายของการอยู่จำพรรษา 3 เดือน ของพระภิกษุ ตามคัมภีร์เรียกว่า
                                วันปวารณา หรือ วันมหาปวารณา นั้น ตรงกับวันขึ้น 15 ค่ำ เดือน 11 เราเรียกกันว่า
                                "วันออกพรรษา" ตามที่เข้าใจกันทั่วไป
                            </p>
                            <p>
                                แต่ตามพระวินัยบัญญัติ พระภิกษุทั้งหลายยังต้องอยู่ในจำพรรษาในคืนวันนั้น (วันขึ้น 15 ค่ำ
                                เดือน 11) อีกคืนหนึ่ง จะไปค้างแรมที่อื่นเลยไม่ได้ ต้องให้ผ่านอรุณเข้าวันใหม่ (วันแรม 1
                                ค่ำ เดือน 11) เสียก่อน
                            </p>
                            <p>
                                สรุปว่า "วันออกพรรษา" ตามที่เรียกและเข้าใจกันทั่วไป (และจะกล่าวถึงต่อไปในบทความนี้)
                                คือวันขึ้น 15 ค่ำ เดือน 11 ส่วน "วันออกพรรษาจริง" ตามพระวินัย คือ วันแรม 1 ค่ำ เดือน 11
                            </p>
                        </div>
                        <div className="col">
                            <img
                                src="https://i.ibb.co/4sy2DS9/punsa.jpg"
                                alt="punsa"
                                border="0"
                                style={{ width: '300px' }}
                            ></img>
                        </div>
                    </div>
                </section>
            </article>
            <div style={{backgroundColor: 'black', width:'1000px',height:'2280px'}}/>
        </PageLayout>
    );
};

export default ReligiousDayPage;
